`use strict`;
// -----------------------------------------------------------Завдання 1:-----------------------------------------------------------

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().
// -------------------------------------------- виконання --------------------------------------------
// let number = prompt("Enter a number: ");
// if (Number(number) === 10) alert("Вірно!");
// else alert(`You entered ${number}!  Невірно!`);

// -----------------------------------------------------------Завдання 2:------------------------------------------------------------

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"
// -------------------------------------------- виконання --------------------------------------------
// const min = Math.floor(Math.random() * (59 - 0) + 0);

// let min = prompt("Enter a number from 0 to 59: ");
// let quarter;
// min = Number(min); // Convert input to number
// if (min >= 0 && min < 15) {
//   quarter = "first";
// } else if (min >= 15 && min < 30) {
//   quarter = "second";
// } else if (min >= 30 && min < 45) {
//   quarter = "third";
// } else if (min >= 45 && min <= 59) {
//   quarter = "fourth";
// } else {
//   quarter = "invalid";
// }

// if (quarter === "invalid") {
//   alert("Please enter a valid number between 0 and 59.");
// } else {
//   alert(`Number ${min} is in the ${quarter} quarter`);
// }

//----------------------------------------------------------- Завдання 3:-----------------------------------------------------------

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.
// -------------------------------------------- виконання --------------------------------------------
// const num = prompt("Enter a number from 1 to 4: ");
// let result;
// switch (num) {
//   case "1":
//     result = "зима";
//     break;
//   case "2":
//     result = "весна";
//     break;
//   case "3":
//     result = "літо";
//     break;
//   case "4":
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно.";
// }
// console.log(result);

// -----------------------------------------------------------Завдання 4:-----------------------------------------------------------

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// -------------------------------------------- виконання --------------------------------------------
// const minutes = prompt("Enter the number of minutes: ");
// const totalMinutes = Number(minutes);
// const hours = Math.floor(totalMinutes / 60);
// const remainingMinutes = totalMinutes % 60;
// const formattedHours = String(hours).padStart(2, "0");
// const formattedMinutes = String(remainingMinutes).padStart(2, "0");
// console.log(`${formattedHours}:${formattedMinutes}`);

// -----------------------------------------------------------Завдання 5:-----------------------------------------------------------

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// -------------------------------------------- виконання --------------------------------------------

// const login = prompt("Enter your login: ");
// console.log(login);
// if (login === "Адмін") {
//   const password = prompt("Enter your password: ");
//   if (password === null) {
//     alert("Скасовано");
//   } else if (password === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else {
//   alert("Я вас не знаю");
// }

// -----------------------------------------------------------Завдання 6:-----------------------------------------------------------

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// -------------------------------------------- виконання --------------------------------------------

// let i = 0;
// while(i <= 20) {
//   console.log(i);
//   i++;
// }

// -----------------------------------------------------------Завдання 7:-----------------------------------------------------------

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// -------------------------------------------- виконання --------------------------------------------

// let sum = 0;
// function getNumbers(min, max) {
//   if (Number(min) && Number(max)) {
//     for (let i = max; i >= min; i--) {
//       console.log(i);
//       if (i % 2 === 0) {
//         sum += i;
//       }
//     }
//     return sum;
//   } else {
//     return "Not a number!";
//   }
// }

// getNumbers(120, 130);
// console.log(`Sum of even numbers: ${sum}`);

// -----------------------------------------------------------Завдання 8:-----------------------------------------------------------

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// -------------------------------------------- виконання --------------------------------------------

// function min(a, b) {
//   if (typeof a === "number" && typeof b === "number") {
//     return a < b ? a : b;
//   } else {
//     return "Not a number!";
//   }
// }

// console.log(min(5,"s"));

// -----------------------------------------------------------Завдання 9:-----------------------------------------------------------

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// -------------------------------------------- виконання --------------------------------------------

// function isAdult(age) {
//   if (typeof age === "number") {
//     if (age >= 18) {
//       return true;
//     } else {
//       return confirm("Are you sure you are an adult?");
//     }
//   } else {
//     return "Not a number!";
//   }
// }

// isAdult(17);

// -----------------------------------------------------------Завдання 10:-----------------------------------------------------------

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// -------------------------------------------- виконання --------------------------------------------

// function fizzBuzz(num) {
//   if (typeof num === "number") {
//     for (let i = 1; i <= num; i++) {
//       if (i % 3 === 0 && i % 5 === 0) {
//         console.log(i, "fizzbuzz");
//       } else if (i % 3 === 0) {
//         console.log(i, "fizz");
//       } else if (i % 5 === 0) {
//         console.log(i, "buzz");
//       } else {
//         console.log(i);
//       }
//     }
//   } else {
//     return "Not a number!";
//   }
// }
// fizzBuzz(32);
